[
  {
    "url": "https://docs.onyx.app/welcome",
    "title": "Welcome to Onyx!",
    "content": "## What is Onyx?\nOnyx is your team's entry point to Generative AI,\noffering a natural language interface for any LLM while integrating seamlessly with your knowledge and applications.\nBuild tailored AI Agents, search for documents, browse the web, and more — all in one place.\n## Major Features\n  The best way to quickly get familiar with Onyx is to check out the features below!\n    Conversational interface to your LLMs, Agents, and knowledge.\n    Create AI agents tailored to your use cases with custom instructions, knowledge, and actions.\n    Search through your organization's knowledge and connected applications.\n    Enrich the knowledge of the LLM with the latest information from the internet.\n    Enable Actions connected to your team's applications to let Agents automate work.\n    Execute code directly within your chat sessions for complex calculations and data analysis.\n  To learn about other features, check out the [Core Features](/overview/core_features/chat)\n  section or visit the [Admin Docs](/admin/overview) for an even more in depth breakdown.\n## Why Onyx?\nWhy choose Onyx over ChatGPT, Microsoft Copilot, Google Gemini, or Glean?\n- **Reliable Responses from Internal Knowledge:**\n  Onyx builds a knowledge index using LLM-native techniques. Powered with contextual retrieval, advanced RAG,\n  hybrid search, and AI-generated knowledge graphs, Onyx ensures the most relevant results and the least hallucinations.\n- **Open Source:**\n  Onyx is made for security, data privacy, and ease of self-hosting. It's easy and free to get started.\n  For teams investing in a long-term GenAI strategy,\n  Onyx can be easily extended or customized to your team's future needs.\n- **Highly Configurable:**\n  Onyx is designed to be flexible, so you can optimize the experience for your team. Plug and play any LLM model,\n  connect only the data you need, and enable the features you want your team to use.\n## Ready to Get Started?\n**Next Steps:**\n    Checkout our quickstart guide to self-host Onyx in minutes.\n    Sign up for a free trial of Onyx Cloud, no credit card required.\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/core_features/actions",
    "title": "Actions & MCP",
    "content": "## Overview\n**Actions** give Agents the ability to interact with external systems.\nOnyx comes with 4 built-in Actions and allows users to configure additional ones via\n[OpenAPI](https://en.wikipedia.org/wiki/OpenAPI_Specification)\nand [Model Context Protocol](https://modelcontextprotocol.io/) (MCP).\nThe built-in Actions include:\n## Custom Actions\nOnyx offers flexible options for configuring both custom Actions and their associated authentication.\nAdmins can choose to:\n- Use a single shared authentication, giving all users the same level of access to Actions.\n- Require each user to complete their own authentication flow, so Actions respect individual user permissions.\nOnyx supports both token-based authentication and OAuth.\n## Actions Button\nIn the Chat input bar, Actions are grouped by the MCP server or OpenAPI schema they are registered with.\nUsers have the flexibility to turn on/off the Actions that the Agent/LLM has access to on the fly.\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/core_features/agents",
    "title": "Agents",
    "content": "Agents are a combination of user specified instructions, knowledge, and [Actions](/overview/core_features/actions).\nThink of them as AI team members that are optimized for a specific task.\nOnyx Agents can be for individual use or shared with other users or\n[user-groups](/admin/user_management/users_and_groups) within Onyx.\n## When to use an Agent\nUse agents to build the best experience for repeat use cases,\nespecially those that can be shared with other members of the team.\nSome common examples include:\n- Onboarding Assistant\n- AI Helpdesk\n- Engineer Copilot\n- Legal Reviewer\nThese are typically scoped down to a particular task such as reviewing documents to ensure they comply with security\npolicies, filling out RFPs based on previously completed ones, etc.\n## Creating an Agent\n### Instructions (Prompting)\n  The Instruction field is infinitely flexible so it is recommended to test different variations and verify the behavior\n  before sharing the Agent broadly with your team.\nProvided below for inspiration is the **Instruction** for the default Onyx experience.\n    ```\n    You are a highly capable, thoughtful, and precise assistant. Your goal is to deeply understand the user's intent, ask clarifying questions when needed, think step-by-step through complex problems, provide clear and accurate answers, and proactively anticipate helpful follow-up information. Always prioritize being truthful, nuanced, insightful, and efficient.\n    The current date is [[CURRENT_DATETIME]]\n    You use different text styles, bolding, emojis (sparingly), block quotes, and other formatting to make your responses more readable and engaging.\n    You use proper Markdown and LaTeX to format your responses for math, scientific, and chemical formulas, symbols, etc.: '$$\\n[expression]\\n$$' for standalone cases and '\\( [expression] \\)' when inline. For code you prefer to use Markdown and specify the language.\n    You can use Markdown horizontal rules (---) to separate sections of your responses.\n    You can use Markdown tables to format your responses for data, lists, and other structured information.\n    ```\n    Note that `[[CURRENT_DATETIME]]` is dynamically replaced and there may be additional Action use instructions\n    depending on the enabled Actions.\nOne of the best parts of creating an Agent is the ability to control the goal/behavior of the Agent.\nThe instructions are purely in natural language and can include things like:\n- Always provide your results in a table.\n- Try to quote directly from the documents rather than rewording anything.\n- Flag information from documents that are older than 3 months.\n### Knowledge\n  It is typically best to include only the necessary knowledge for the Agent to complete its task.\n  The more scoped down the documents, the more reliable the performance.\nWhen creating an Agent, you can include both knowledge from [connectors](/overview/core_features/connectors)\nor file upload. The knowledge from connectors will be kept up to date as documents change in the external sources.\n### Actions\n  If any of the built-in actions (Web Search, Internal Search, Image Generation, Code Interpreter) are missing,\n  contact your Onyx admin.\n  These must be set up in the admin-panel before being made available in the Agent creation flow.\n[Actions](/overview/core_features/actions) (sometimes known as Tools)\nallow the Agents to do things in external applications via APIs.\nSome tools help Onyx give better answers (such as the Onyx built-in tools)\nwhile others allow the system to do more than answer questions.\nSome example common Actions include:\n- Updating ticket statuses based on the conversation and if the user's needs were addressed.\n- Checking the status of a service to give real-time answers.\n- Moving deals along a sales pipeline in a CRM based on call transcripts or user request.\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/core_features/chat",
    "title": "Chat",
    "content": "  On the top left of the page (just right of the sidebar), you can select the mode of the UI.\n  Replace \"Auto\" with \"Chat\" to always go into this Chat UI.\nOnyx provides a natural language chat interface as the main way of interacting with the features.\nThe page below contains an overview of the main components and features.\n## Input Bar\n### Chat with Files / URLs\nThe leftmost button of the input bar lets users add context into the Chat session.\nUsers can choose between uploading files or selecting URLs as well as reusing previous files or URLs.\n  URLs behind Logins, Captcha, or Paywalls that are not scrapeable are not accessible.\n  Consider using a [Connector](/overview/core_features/connectors) instead.\n### Actions Selector\nThe second button lets users disable or force the use of Actions. There are 4 built-in Actions:\n- **[Internal Search](/overview/core_features/internal_search)**:\n  Enables the LLM to search the indexed knowledge from [Connectors](/overview/core_features/connectors).\n- **[Web Search](/overview/core_features/web_search)**: Enables the LLM to search the internet.\n  Requires an admin to set up an API key for a search provider.\n- **[Code Interpreter](/overview/core_features/code_interpreter)**:\n  Enables the LLM to use a sandboxed Python runtime to execute code and run data analysis.\n- **[Image Generation](/overview/core_features/image_generation)**: Allows the LLM to generate images.\n  Requires setting up an image generation API.\nThe Actions below the separator represent custom admin configured Actions.\nSee [Actions & MCP](/overview/core_features/actions) to learn about custom Actions.\n### Deep Research\nToggle **Deep Research** using the hourglass icon. When turned on, the LLM will be able to run many cycles of thinking,\nresearch, and actions to give the best possible result for the user.\nThis mode is intended for complicated questions that may need to pull together many sources together or requires\nsignificant reasoning.\n  Deep Research may take up to several minutes and could cost many times (>10x) the token cost of a normal inference.\n### Model Selector\nOnyx supports all major LLM providers as well as self-hosting options like Ollama, VLLM, etc. For select models,\nusers can also configure the creativity and reasoning level.\n## Sidebar Contents\nThe left sidebar contains:\n- `New Session` button to clear the history and start a new Chat or [Search](/overview/core_features/internal_search) session.\n- `Projects` to help users organize chats and reuse different sets of documents. See section below for more info.\n- `Agents` section to start a new session with yours or your team's custom [Agents](/overview/core_features/agents).\n- `Sessions` section containing a list of the most recent conversations.\nThe right sidebar contains sources and citations that were used in generating the answer.\nThese can come from either `Internal Search` or `Web Search` or both.\nDocuments in the right sidebar can also be selected to be included in full for the next message in the Chat session.\n  It's often useful to ask a question to find a document, then select it to do a deep dive on it.\n## Projects\n**Projects** are a collection of instructions (prompts) and files as well as a grouping for chats.\nUse projects to organize ongoing work,\nor as a handy way to reuse instructions and files without going through the Agent creation flow.\n## Miscellaneous Chat Features\n**Chat Sharing** - share chats with other team members by using the share-chat button in the top right (left of the\nSources sidebar).\n**Feedback** - give feedback viewable to the admins using the thumbs-up/thumbs-down buttons when hovering an LLM\nresponse\n**Regenerate** - modify your inputs by clicking the user messages or regenerate the LLM response with another model.\n**Copying** - copy the LLM output or markdown/code blocks by clicking on the copy button which shows on hover.\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/core_features/code_interpreter",
    "title": "Code Interpreter",
    "content": "## Overview\n    Example run where the LLM generates code to run data analysis on a business report.\nThe ability to execute code unlocks the ability for the LLMs to do things such as:\n- Performing larger calculations accurately\n- Running data analysis on provided files\n- Generating or modifying data/files\n**Note**: The code interpreter is built-in functionality available to all deployments without any configuration needed.\n## Features\n- **Python Runtime**: A secure Python runtime with all dangerous functionality removed (such as accessing the network,\n  directories outside of the specified, etc.)\n- **Libraries**: Comes with a set of libraries such as numpy, pandas, scipy, matplotlib, and more.\n- **File Input**: Ability to pass arbitrary file types along with the code to run against it.\n- **File Output**: Files can be created and provided back to the user.\n- **STDIN/STDOUT Capture**: Ability to show the user any outputs of the programs executed.\n- **Graph Rendering**: The Onyx [Chat UI](/overview/core_features/chat)\n  is able to render returned graphs and other visualization for the user.\n## Usage\nThe Code Interpreter does not need to be invoked explicitly,\nthe LLM will determine when to use it depending on the user query.\nIt can also be attached to custom Agents, giving the LLM the option to use it as needed.\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/core_features/connectors",
    "title": "Connectors",
    "content": "## What are Connectors?\nOnyx uses Connectors to build an understanding of your documents, team,\nand higher level concepts so that answers are grounded and specific to your organization's knowledge.\nConnectors:\n- Keep all updates synced between external systems and Onyx.\n- Pull in metadata and additional signals to ensure answer relevance.\n- Respect all user permissions (Enterprise Edition only).\n## Common Connector Questions\n  Click this card to see the full list of supported connectors.\n  You can also push documents directly into Onyx via [API](/developers/guides/index_files_ingestion_api)\n  or via File Upload.\n  All processing and storage of documents and metadata happen within Onyx.\n  There are options to use LLMs or third party providers during the indexing flow but by default everything is\n  processing entirely locally.\n  Click this card to see more about security.\n  In the same way LLMs are pre-trained on massive amounts of internet data,\n  Onyx builds an understanding of all of the documents, concepts, and people within your organization.\n  This allows Onyx to provide more accurate answer to questions that relate to internal knowledge compared to using the\n  applications' provided search APIs at query time.\n  Click this card to learn more about Internal Search in Onyx.\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/core_features/image_generation",
    "title": "Image Generation",
    "content": "## Overview\nThe image generation feature allows users to create PNG images according to their prompts which can be rendered in the\nchat and easily downloaded.\n## Configuration\nCurrently, Onyx supports two APIs for image generation, both through OpenAI. In the future,\nthere likely will be support for other options such as Google Imagen or Stability AI.\n**GPT-Image-1**: Newer model, better prompt adherence. Likely a better default for most use cases.\n**DALL-E 3**: Older model, slightly better for more imaginative and rich styles.\n## Usage\nTo use **Image Generation**,\nbe explicit in the prompting since the system is tuned to not generate images unless directly instructed.\nSee below for the instructions provided to the system for when to create images.\n    Tool Description:\n    ```\n    Generate an image from a prompt.\n    ```\n    Instruction (System Prompt) Modification:\n    ```\n    NEVER use image_gen unless the user specifically requests an image.\n    ```\n    This phrase is injected into the default **Instruction** for Onyx if the **Image Generation** (image_gen)\n    tool is available.\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/core_features/internal_search",
    "title": "Internal Search",
    "content": "One of Onyx's most standout features is the ability to enrich the LLM's general world knowledge with context unique to\nyour team. Onyx uses [Connectors](/overview/core_features/connectors)\nto index knowledge from your team's applications to build an understanding of the documents, people,\nand concepts within your organization.\nDocuments, metadata, and access permissions are all kept up to date in near real time.\n## Search UI\n  On the top left of the page, you can select the mode of the UI.\n  Replace \"Auto\" with \"Search\" to always go into this view.\n  Onyx's context retrieval respects user level permissions which is only configurable via the Enterprise Edition.\nOnyx's knowledge connectivity can be used via both the **Search** and [Chat](/overview/core_features/chat) interface.\nThe Search interface provides a better view of documents and is better for quickly accessing documents when the intent\nis not to get an answer.\nUsers do not need to explicitly select this mode — when a query is classified by Onyx as a document search,\nit will automatically go into this UI experience.\n### Filters\nThe Search UI also provides more advanced filtering options:\nThe top bar allows users to filter by time ranges (date range / time offset), authors, and tags (e.g. `Folder:\nEngineering`).\nThe side filters allow users to filter by the source type of the documents.\n## Chat UI\nContext from your applications are also available in the Chat UI and to Onyx Agents.\nDeep Research mode is also a Chat UI feature.\nClick [here](/overview/core_features/chat) to learn more about the Chat experience.\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/core_features/web_search",
    "title": "Web Search",
    "content": "## Overview\nOnyx can access the internet for questions that require up to date information or for niche information that the LLM may\nnot be certain about.\nUsers can toggle the **Web Search** Action on the fly to override the LLM's decision.\nIf [Internal Search](/overview/core_features/internal_search) was used during the research process,\nOnyx will seamlessly combine web sources with internal documents in both the answer generation and for displaying in the\nUI.\n## Requirements\nTo provide Web Search functionality,\nOnyx requires both the ability to get search results and to be able to parse websites for more complete context.\nThis is broken down into 1) *the search provider* and 2) *the web scraper*.\n### Search Providers\nOnyx provides multiple search providers (pricing subject to change, please double check):\n| Name | Provider | Price | Benefit |\n|------|----------|-------|---------|\n| Google PSE | Google | Free tier + $5/1000 queries | Official Google search results, high trust option for security conscious teams. |\n| Serper | Serper.dev | Free tier + $0.30/1000 queries | Fast, and cost-effective |\n| Exa | Exa.ai | $5/1000 queries | AI-optimized with better semantic capabilities|\n### Web Scraper\nAs the Search Providers only give short snippets and metadata,\na scraper is used to fetch the full site contents for more complete/reliable answers.\n| Name | Requires Config | Benefits |\n|------|----------------|----------|\n| Onyx built-in | No  | No third parties get access to user queries, free to use |\n| Firecrawl | Yes, API key | More performant with better edge case handling |\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/core_features/workflows",
    "title": "Workflows (Coming Soon)",
    "content": "  **Coming Soon!**\n  This feature is currently under development. Stay tuned for updates!\n## What's Coming\nThe Onyx Workflows feature will enable:\n- **Asynchronous Actions**: Set up Agents to run when triggered by events or on a time basis.\n- **Batch Processing**: Set up instructions to run against large sets of objects to automate repeat work.\n- **Acknowledgements**: Optionally set up notifications to give approval for more sensitive Actions.\n- **Reports**: Get breakdowns of the work that was done for you in the background.\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/getting_started/faq",
    "title": "FAQ",
    "content": "## General Questions\n    You can ask Onyx about general world knowledge known to the LLM,\n    knowledge from [connected applications](/overview/core_features/internal_search),\n    or things searchable on the web (if [Web Search](/overview/core_features/web_search) is configured)\n    Please check the [Security](/security/architecture/system_description) tab to learn more.\n    Onyx is built with security and data privacy as a core commitment.\n    Onyx is built for teams of all sizes whether it's a single user looking for a local Chat UI or a global enterprise\n    needing a unified GenAI solution for the entire workforce.\n    Onyx emphasizes data privacy and security as well as reliable responses by connecting to knowledge whether private\n    or from the web.\n   Yes, however Onyx needs an LLM to function properly.\n   You can air gap the entire system but you would need to run a local LLM.\n   Note that we strongly recommend using a recent and non-quantized LLM for the best experience.\n## Technical Issues\n    The most common culprit is under-resourcing the deployment.\n    Please refer to the [Resourcing](/deployment/getting_started/resourcing) page to double check.\n    No! Onyx is intended to provide a fast and snappy experience. If the responses are slow,\n    it may be due to a couple issues.\n    - The LLM attached to the system is slow, has low throughput, or does not support streaming.\n    - You've configured locally running models that are not the default but you do not have a GPU available to the\n      system. Typically this is from setting a local reranking or embedding model.\n## Knowledge and Search\n    If it's an internal document,\n    it may be because the indexing of the application has not completed or because the access controls are incorrectly\n    set. In cases of failure, the system always defaults to least permissive.\n    The most common failure is that the [connector](/admin/connectors/overview) is incorrectly configured.\n    Onyx connectors will fetch updates on a set schedule (typically 30 minutes),\n    this polling frequency can be configured by the admin for each connector. The documents, metadata,\n    and access permissions all receive updates.\n    Web Search must be configured by an admin to be usable.\n    It requires setting up one of the supported Search providers and also a scraper (though this is optional as Onyx\n    provides one built in).\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/getting_started/use_cases",
    "title": "Use Cases",
    "content": "  [See how Ramp uses Onyx](https://www.onyx.app/blog/ramp-case-study)\n  to automatically resolve 93% of internal and customer questions!\n## AI-Powered Team\nGive your team secure access to all major LLMs such as GPT, Claude, Gemini, Deepseek, Llama,\nand more - all with access to advanced utilities.\n    Use LLMs to help quickly summarize documents, explain key concepts, or create derivative works.\n    Get answers to any topic using a combination of Web Search and internal knowledge or run a deeper exploration with\n    Deep Research.\n    Execute code to run complex data crunching tasks, generate graphs to help visualize results,\n    and chat with the LLM to interpret the results.\n    Generate images, draft content from scratch, or refine existing works with AI suggestions.\n## Enterprise Search\nQuickly access knowledge across all of your team's applications from wikis to chats and everything in between.\n    A single interface to find knowledge across the entire organization.\n    Leverage analytics and users feedback to identify holes in your team's knowledge base.\n    Reduce misinformation and downstream costs.\n    Let new team members unblock themselves and reduce distractions for more senior members.\n## Sales\nHelp your sales team stay up to date and focus on closing.\n    Instantly access customer history, past interactions,\n    and account details before any call or ask questions against past call transcripts.\n    Gather competitive intelligence and stay ahead of the market.\n    Create custom Agents to run deep analysis on your pipeline based on all connected knowledge.\n## Support\nKeep customers happy with faster resolutions and more reliable support.\n    AI helps your team quickly surface past tickets and runbooks to craft accurate answers for users.\n    Onyx ensures that all knowledge is kept up to date with any product or documentation changes.\n    Build automations on Onyx to automatically resolve up to >90% of customer tickets.\n## Engineering\nHelp your team ship with speed and confidence through access to GenAI and internal knowledge.\n    Accelerate development by having an AI copilot for every developer.\n    Have Onyx find and explain design docs, internal services,\n    and relevant other projects to ensure devs have full context for every project.\n    Quickly check against past tickets and projects to avoid duplicate work and accumulation of tech debt.\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/miscellaneous/contact_us",
    "title": "Contact Us",
    "content": "Contact us at [hello@onyx.app](mailto:hello@onyx.app) or book a call with us on our [Calendar](https://cal.com/team/onyx/founders).",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/miscellaneous/open_source_statement",
    "title": "Open Source Statement",
    "content": "## Our Mission\nOur mission is to make Generative AI and knowledge accessible to every team worldwide.\nAs large language models—both proprietary and open-source—become increasingly widespread,\nOnyx serves as the interface to their knowledge and reasoning capabilities.\nOnyx enriches the utility of the LLM by providing additional context (both web and team internal),\nbuilt-in tools like code interpreter, and user created Actions.\n## Why Open Source?\n  We believe teams should feel safe with the AI platform that they adopt. That's why Onyx is fully transparent.\n  You'll have peace of mind knowing exactly how your data is processed and stored,\n  and all of this happening within the Onyx deployment.\n  With GenAI being such a fundamental piece of modern company strategy,\n  we want to offer the most flexible and future proof option.\n  We understand that every team is unique in their needs so we're building Onyx with an emphasis on customizability,\n  both for building on top of the platform and directly modifying it.\n  Open source also gives control over to your team. With the GenAI space rapidly evolving,\n  your vendor of choice may not always be aligned with your team's direction.\n  OSS combines the benefits of building in-house with getting product updates for free.\n  Open source also prevents lock in so that you can leverage any LLM provider (or your own LLM).\n## Commercial Viability\nWe are a team of builders and we want to have as many people find value from our software as possible.\nThis is our singular goal and everything that we do derives from this.\nTo push the boundaries of user experience and AI innovation,\nwe've assembled a core team of world-class developers who share this vision.\nTo borrow from Sid Sijbrandij (Co-Founder, GitLab):\n> \"We need to think in the interests of the project, while tending to the realities of running a business to support it... After all, we know that to sustain the project, we need to make it commercially viable.\"\nWe believe in radical transparency—both in how we build open software and in the commercial realities of competing in\nthis rapidly evolving space.\n  Every organization, regardless of size or budget, will always have access to Onyx's core capabilities—including RAG,\n  deep research, custom agents, and more—completely free.\nFor organizations with special requirements—such as usage auditing, granular access controls,\nand white-labeling—we offer the Enterprise Edition, available both as a self-hosted solution and through Onyx Cloud.\nThe Enterprise Edition sustains our mission,\nenabling us to keep the vast majority of Onyx's features free and open for everyone.\n## On Contributions\nOnyx is a project built in collaboration with our community and we openly welcome contributions.\nIt is a point of emphasis of our team to ensure that the Onyx project continues to be easy for teams to contribute to or\nmaintain in house. This comes down to:\n- Intentional high level architecture.\n- Strong product direction and refusal to accept bloat for niche use cases.\n- A consistent and high quality of engineering best practices across the code base.\nTo that end,\nwe ask that contributors work on smaller issues to start and get approval from the maintainers for larger feature\ncontributions.\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/onyx_anywhere/chrome_extension",
    "title": "Chrome Extension",
    "content": "  The Chrome extension is available but is undergoing a fairly major rework,\n  it is recommended to wait until the next major release prior to deploying this\nUse the Onyx extension to ask questions from anywhere. You can also replace your new-tab page with a custom Onyx page:\n- Onyx Search on new tabs\n- Favorite website bookmarks\n- Onyx as a sidebar to any page in Chrome\n  In the future,\n  the Onyx Chrome Extension will allow you to ask questions about the page you are currently on and optionally index the\n  recent pages into the Onyx knowledge base.\n  You'll be able to ask questions about recently visited pages via both the extension and the Onyx web app.\n## Getting Started\nOnce your administrator has set up the Chrome extension for your organization, you can start using it immediately.\n**For Onyx Cloud users**: Install directly from the Chrome Web Store **For self-hosted users**:\nYour administrator will provide installation instructions\n## Using the Extension\n### **Ask Questions Anywhere**\n- Click the Onyx extension icon in your browser toolbar\n- Type your question in natural language\n- Get instant answers with source citations\n### **New Tab Experience**\n- Replace your default new tab with Onyx search\n- Access your favorite website bookmarks\n- Quick search across your organization's knowledge\n### **Sidebar Mode**\n- Open Onyx as a sidebar on any webpage\n- Ask questions about your current work without leaving the page\n- Perfect for research and context-sensitive queries\n## Settings and Options\nTo customize your extension experience:\n    Click the three dots (...) next to the Onyx extension\n    Select **Options**\n    Configure your preferences for search, bookmarks, and new tab behavior\n  **Need help with setup?** Contact your Onyx administrator for installation assistance or configuration questions.\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/onyx_anywhere/mobile_app",
    "title": "Mobile App (Coming Soon)",
    "content": "  Currently Onyx is a responsive application and so your Onyx deployment will work on your smartphone or tablet via your\n  browser app.\n  While is is not as nice of an experience as a native app,\n  it can be used in the meantime while the Onyx Mobile App is under development.\n## Mobile App\nThe Onyx mobile app is currently under development.\nThis native mobile application will bring the full power of Onyx to your smartphone and tablet devices.\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/onyx_anywhere/slack",
    "title": "Slack Bot",
    "content": "## Overview\nBring Onyx's AI capabilities directly into your conversations via Slack App.\nOnyx allows for highly flexible Slack configurations so that you use all of your Onyx Agents directly in your favorite\nchannels.\n## Supported Features\n- Support for unlimited Slack Apps. This way you can associate Slack Apps with Onyx Agents for specific use cases.\n- Channel level configurations. Every channel can have different default behavior based on the channel's purpose.\n- Answers using internal or web knowledge are backed by citations and link back to the original sources.\n- Works in Threads, Channels and DMs.\n  Try asking Onyx to summarize Threads by tagging the Onyx Slack Bot in the Thread!\n## Try it out\nThe Onyx Slack Bot is always live and serving answers to the community in our public Slack.\nTo test it out,\njoin the [community Slack](https://join.slack.com/t/onyx-dot-app/shared_invite/zt-34lu4m7xg-TsKGO6h8PDvR5W27zTdyhA)\nand see the #ask-onyx channel or tag **@OnyxBot** from anywhere.\n",
    "chunk_ind": 0
  },
  {
    "url": "https://docs.onyx.app/overview/onyx_anywhere/web_interface",
    "title": "Web App",
    "content": "The Web App is the default way to use Onyx and the recommended for the most complete experience.\nThe admin panel is also a web-app exclusive feature which is the easiest way to manage the\n[Agents](/overview/core_features/agents), [Actions](/overview/core_features/actions),\n[Connectors](/overview/core_features/connectors), users, settings and more.\n  A great place to get familiar with the experience is to start with the [Chat](/overview/core_features/chat)\n  overview or the [Admin](/admin/overview) tab for managing the deployment.\nIf you're deploying Onyx locally (guide [here](/deployment/getting_started/quickstart)),\nyou should be able to access the Web UI at http://localhost:3000/.\n",
    "chunk_ind": 0
  }
]